Revit 2026 API

# UnitsDigitGroupingSymbol Property

---

The symbol used to separate groups of digits when numbers are formatted with digit grouping.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DigitGroupingSymbol DigitGroupingSymbol { get; set; }
```
```vb
Public Property DigitGroupingSymbol As DigitGroupingSymbol
	Get
	Set
```
```cpp
public:
property DigitGroupingSymbol DigitGroupingSymbol {
	DigitGroupingSymbol get ();
	void set (DigitGroupingSymbol value);
}
```
```fsharp
member DigitGroupingSymbol : DigitGroupingSymbol with get, set
```

#### Property Value

DigitGroupingSymbol The digit grouping symbol. The default is Comma.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This setting only has an effect when the UseDigitGrouping property is set to true in the FormatOptions object for the unit type being formatted.

#### Reference

Units Class

Autodesk.Revit.DB Namespace